gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_Landis.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/RM_RxDATA.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Calculate/Calculate.h"
#include "../DL698/EVENT_Record.h"



const u8 LandisData_1[]=
{
	"/LGZ4    \r\n",
};
const u8 LandisData_2[]=
{
	02,0x46,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x29,0x0D,0x0A,
//0(84045764)
	0x30,0x28,0x38,0x34,0x30,0x34,0x35,0x37,0x36,0x34,0x29,0x0D,0x0A,
//11(16:03:55)
	0x31,0x31,0x28,0x31,0x36,0x3A,0x34,0x36,0x3A,0x31,0x39,0x29,0x0D,0x0A,
//12(18-08-20)
	0x31,0x32,0x28,0x31,0x38,0x2D,0x30,0x38,0x2D,0x32,0x30,0x29,0x0D,0x0A,
//20(000004.64*kWh)
	0x32,0x30,0x28,0x30,0x30,0x30,0x30,0x30,0x34,0x2E,0x36,0x34,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//20*7(000004.64)
	0x32,0x30,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x34,0x2E,0x36,0x34,0x29,0x0D,0x0A,
//22(000000.04*kWh)
	0x32,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x34,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//22*7(000000.04)
	0x32,0x32,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x34,0x29,0x0D,0x0A,
//21(000002.33*kvarh)
	0x32,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x32,0x2E,0x33,0x33,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//21*7(000002.33)
	0x32,0x31,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x32,0x2E,0x33,0x33,0x29,0x0D,0x0A,
//23(000000.19*kvarh)
	0x32,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x39,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//23*7(000000.19)
	0x32,0x33,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x39,0x29,0x0D,0x0A,
//8.1(000001.07*kWh)
	0x38,0x2E,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x31,0x2E,0x30,0x37,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//8.1*7(000001.07)
	0x38,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x31,0x2E,0x30,0x37,0x29,0x0D,0x0A,
//8.2(000003.44*kWh)
	0x38,0x2E,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x33,0x2E,0x34,0x34,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//8.2*7(000003.44)
	0x38,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x33,0x2E,0x34,0x34,0x29,0x0D,0x0A,
//8.3(000000.12*kWh)
	0x38,0x2E,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x32,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//8.3*7(000000.12)
	0x38,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x32,0x29,0x0D,0x0A,
//8.4(000000.00*kWh)
	0x38,0x2E,0x34,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//8.4*7(000000.00)
	0x38,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//38.1(000000.00*kWh)
	0x33,0x38,0x2E,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//38.1*7(000000.00)
	0x33,0x38,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//38.2(000000.01*kWh)
	0x33,0x38,0x2E,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x31,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//38.2*7(000000.01)
	0x33,0x38,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x31,0x29,0x0D,0x0A,
//38.3(000000.03*kWh)
	0x33,0x38,0x2E,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x33,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//38.3*7(000000.03)
	0x33,0x38,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x33,0x29,0x0D,0x0A,
//38.4(000000.00*kWh)
	0x33,0x38,0x2E,0x34,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x68,0x29,0x0D,0x0A,
//38.4*7(000000.00)
	0x33,0x38,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//9.1(000000.45*kvarh)
	0x39,0x2E,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x34,0x35,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//9.1*7(000000.45)
	0x39,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x34,0x35,0x29,0x0D,0x0A,
//9.2(000001.75*kvarh)
	0x39,0x2E,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x31,0x2E,0x37,0x35,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//9.2*7(000001.75)
	0x39,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x31,0x2E,0x37,0x35,0x29,0x0D,0x0A,
//9.3(000000.12*kvarh)
	0x39,0x2E,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x32,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//9.3*7(000000.12)
	0x39,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x32,0x29,0x0D,0x0A,
//9.4(000000.00*kvarh)
	0x39,0x2E,0x34,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//9.4*7(000000.00)
	0x39,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//39.1(000000.00*kvarh)
	0x33,0x39,0x2E,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//39.1*7(000000.00)
	0x33,0x39,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//39.2(000000.01*kvarh)
	0x33,0x39,0x2E,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x31,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//39.2*7(000000.01)
	0x33,0x39,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x31,0x29,0x0D,0x0A,
//39.3(000000.17*kvarh)
	0x33,0x39,0x2E,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x37,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//39.3*7(000000.17)
	0x33,0x39,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x31,0x37,0x29,0x0D,0x0A,
//39.4(000000.00*kvarh)
	0x33,0x39,0x2E,0x34,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x76,0x61,0x72,0x68,0x29,0x0D,0x0A,
//39.4*7(000000.00)
	0x33,0x39,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x2E,0x30,0x30,0x29,0x0D,0x0A,
//39.4*7(000000.00)
	0x36,0x2E,0x30,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.0(00.00*kW)(00-00-00 00:00)
	0x36,0x2E,0x30,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.0*7(00.00)(00-00-00 00:00)
	0x33,0x36,0x2E,0x30,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.0(00.00*kW)(00-00-00 00:00)
	0x33,0x36,0x2E,0x30,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.0*7(00.00)(00-00-00 00:00)
	0x37,0x2E,0x30,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x76,0x61,0x72,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//7.0(00.00*kvar)(00-00-00 00:00)
	0x37,0x2E,0x30,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//7.0*7(00.00)(00-00-00 00:00)
	0x33,0x37,0x2E,0x30,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x76,0x61,0x72,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//37.0(00.00*kvar)(00-00-00 00:00)
	0x33,0x37,0x2E,0x30,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//37.0*7(00.00)(00-00-00 00:00)
	0x36,0x2E,0x31,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.1(00.00*kW)(00-00-00 00:00)
	0x36,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.1*7(00.00)(00-00-00 00:00)
	0x36,0x2E,0x32,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.2(00.00*kW)(00-00-00 00:00)
	0x36,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.2*7(00.00)(00-00-00 00:00)
	0x36,0x2E,0x33,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.3(00.00*kW)(00-00-00 00:00)
	0x36,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.3*7(00.00)(00-00-00 00:00)
	0x36,0x2E,0x34,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.4(00.00*kW)(00-00-00 00:00)
	0x36,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//6.4*7(00.00)(00-00-00 00:00)
	0x33,0x36,0x2E,0x31,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.1(00.00*kW)(00-00-00 00:00)
	0x33,0x36,0x2E,0x31,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.1*7(00.00)(00-00-00 00:00)
	0x33,0x36,0x2E,0x32,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.2(00.00*kW)(00-00-00 00:00)
	0x33,0x36,0x2E,0x32,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.2*7(00.00)(00-00-00 00:00)
	0x33,0x36,0x2E,0x33,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.3(00.00*kW)(00-00-00 00:00)
	0x33,0x36,0x2E,0x33,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.3*7(00.00)(00-00-00 00:00)
	0x33,0x36,0x2E,0x34,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x6B,0x57,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.4(00.00*kW)(00-00-00 00:00)
	0x33,0x36,0x2E,0x34,0x2A,0x37,0x28,0x30,0x30,0x2E,0x30,0x30,0x29,0x28,0x30,0x30,0x2D,0x30,0x30,0x2D,0x30,0x30,0x20,0x30,0x30,0x3A,0x30,0x30,0x29,0x0D,0x0A,
//36.4*7(00.00)(00-00-00 00:00)
	0x4C,0x2E,0x31,0x28,0x2D,0x2D,0x2D,0x2E,0x2D,0x2A,0x56,0x29,0x0D,0x0A,
//L.1(---.-*V)
	0x4C,0x2E,0x32,0x28,0x2D,0x2D,0x2D,0x2E,0x2D,0x2A,0x56,0x29,0x0D,0x0A,
//L.2(---.-*V)
	0x4C,0x2E,0x33,0x28,0x32,0x32,0x36,0x2E,0x33,0x2A,0x56,0x29,0x0D,0x0A,
//L.3(225.9*V)
	0x41,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x41,0x29,0x0D,0x0A,
//A(00.00*A)
	0x42,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x41,0x29,0x0D,0x0A,
//B(00.00*A)
	0x43,0x28,0x30,0x30,0x2E,0x30,0x30,0x2A,0x41,0x29,0x0D,0x0A,
//C(00.00*A)
	0x37,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x36,0x30,0x32,0x29,0x0D,0x0A,
//71(00000602)
	0x37,0x32,0x2E,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x34,0x38,0x33,0x29,0x0D,0x0A,
//72.1(00000483)
	0x37,0x32,0x2E,0x32,0x28,0x30,0x30,0x30,0x30,0x30,0x31,0x33,0x30,0x29,0x0D,0x0A,
//72.2(00000130)
	0x37,0x32,0x2E,0x33,0x28,0x30,0x30,0x30,0x30,0x30,0x32,0x39,0x35,0x29,0x0D,0x0A,
//72.3(00000295)
	0x31,0x33,0x2E,0x37,0x28,0x20,0x2D,0x2E,0x2D,0x2D,0x29,0x0D,0x0A,
//13.7( -.--)
	0x33,0x31,0x2E,0x31,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//31.1(----*Deg)
	0x33,0x31,0x2E,0x32,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//31.2(----*Deg)
	0x33,0x31,0x2E,0x33,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//31.3(----*Deg)
	0x35,0x31,0x2E,0x31,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//51.1(----*Deg)
	0x35,0x31,0x2E,0x32,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//51.2(----*Deg)
	0x35,0x31,0x2E,0x33,0x28,0x2D,0x2D,0x2D,0x2D,0x2A,0x44,0x65,0x67,0x29,0x0D,0x0A,
//51.3(----*Deg)
	0x43,0x2E,0x32,0x31,0x28,0x30,0x30,0x30,0x30,0x30,0x30,0x30,0x33,0x29,0x0D,0x0A,
//C.21(00000003)
//95(05-04-08 11:55)
	0x39,0x35,0x28,0x30,0x35,0x2D,0x30,0x34,0x2D,0x30,0x38,0x20,0x31,0x31,0x3A,0x35,0x35,0x29,0x0D,0x0A,
//1(50)
	0x31,0x28,0x35,0x30,0x29,0x0D,0x0A,
//1*7(18-08-01 09:09)
	0x31,0x2A,0x37,0x28,0x31,0x38,0x2D,0x30,0x38,0x2D,0x30,0x31,0x20,0x30,0x39,0x3A,0x30,0x39,0x29,0x0D,0x0A,
//14(117191)
	0x31,0x34,0x28,0x31,0x31,0x37,0x31,0x39,0x32,0x29,0x0D,0x0A,
//90(00004584)
	0x39,0x30,0x28,0x30,0x30,0x30,0x30,0x34,0x35,0x38,0x34,0x29,0x0D,0x0A,
//91(06764)
	0x39,0x31,0x28,0x30,0x36,0x37,0x36,0x34,0x29,0x0D,0x0A,
//0.2.0(B22)
	0x30,0x2E,0x32,0x2E,0x30,0x28,0x42,0x32,0x32,0x29,0x0D,0x0A,
	
	0x21,0x0D,0x0A,0x03,0x43,
};





