gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_Landis.c
u32 RM_Rx_Landis(u32 PORTn)//Landis(IEC1107 模式C)接收;返回:0=正在接收,1=完成1帧接收,2=接收超时
{
	u32 i;
	u32 p0;
	u32 p1;
	u32 RxByte;
	
	u8 * p8fifo;
	u16 * p16fifo;
	u8 * p8rx;
	u16 * p16timer;
  UARTCtrl_TypeDef * UARTCtrl;
	u32 fEXT;
	
	u32 LEN_UARTnIntRx=Get_LEN_UARTnIntRx(PORTn);	
	u32 LEN_UARTnRx=Get_LEN_UARTnRx(PORTn);
  UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8fifo=(u8 *)(Get_ADDR_UARTn(PORTn)+10);
	p16fifo=(u16 *)Get_ADDR_UARTn(PORTn);
	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);

	DMA_UARTn_RX_Pointer(PORTn);//计算DMA_UARTn接收指针值(p0)
	p0=p16fifo[0];//中断接收指针
	p1=p16fifo[1];//当前已读指针
	if((p0>=(LEN_UARTnIntRx-10))||(p1>=(LEN_UARTnIntRx-10)))
	{
		p16fifo[0]=0;//中断接收指针
		p16fifo[1]=0;//当前已读指针
		p16fifo[2]=0;//规约检查指针
		p16fifo[3]=0;
		p16fifo[4]=0;
		return 0;
	}
	
//---RxTEST---
/*
	switch(UARTCtrl->CONNECT)
	{
		case 1:
			MR((u32)p8rx,(u32)LandisData_1,sizeof(LandisData_1));
			UARTCtrl->RxByte=sizeof(LandisData_1);
			return 1;//1=接收OK
		case 101:
			MR((u32)p8rx,(u32)LandisData_2,sizeof(LandisData_2));
			UARTCtrl->RxByte=sizeof(LandisData_2);
			return 1;//1=接收OK
		default:
			break;
	}
*/
//---RxTEST END---
	
	RxByte=UARTCtrl->RxByte;
	if(p0!=p1)
	{//有数据接收重置超时定时
		p16timer[0]=500/10;//字节间超时定时
		if(PORTn==RS485_1PORT)
		{
			Terminal_Ram->RS485_1_RxLED_MS_Timer=20/10;//11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
		}
		if(PORTn==RS485_2PORT)
		{
			Terminal_Ram->RS485_2_RxLED_MS_Timer=20/10;//11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
		}
	}
	fEXT=0;//收到EXT字节标志
	while(p0!=p1)
	{
		i=p8fifo[p1];
		i&=0x7f;//数据=7位
		switch(UARTCtrl->CONNECT)//连接:0=空,1=启动连接，2=，100=连接,101=抄表中,102=关闭连接
		{
			case 101://数据帧
				if(RxByte==0)
				{
					if((i!=1)&&(i!=2))//SOH,STX
					{
						p1++;
						if(p1>=(LEN_UARTnIntRx-10))
						{
							p1=0;
						}
						continue;
					}
				}
				if(RxByte>=LEN_UARTnRx)
				{
					RxByte=0;
				}
				p1++;
				if(p1>=(LEN_UARTnIntRx-10))
				{
					p1=0;
				}
				p8rx[RxByte]=i;
				RxByte++;
				if(fEXT)//收到EXT字节标志
				{
					p16fifo[1]=p1;
					UARTCtrl->RxByte=RxByte;
					return 1;//1=接收OK
				}
				if(i==3)//ETX
				{
					fEXT=1;//收到EXT字节标志
				}
				break;
			default://握手帧
				if(RxByte==0)
				{
					if(i!='/')//'/'
					{
						p1++;
						if(p1>=(LEN_UARTnIntRx-10))
						{
							p1=0;
						}
						continue;
					}
				}
				if(RxByte>=LEN_UARTnRx)
				{
					RxByte=0;
				}
				p1++;
				if(p1>=(LEN_UARTnIntRx-10))
				{
					p1=0;
				}
				p8rx[RxByte]=i;
				RxByte++;
				if(i==0x0a)//LF
				{
					p16fifo[1]=p1;
					UARTCtrl->RxByte=RxByte;
					return 1;//1=接收OK
				}
				break;
		}
	}
	p16fifo[1]=p1;
	UARTCtrl->RxByte=RxByte;
	if(p16timer[0]==0x0)
	{//超时
		return 2;//2=接收超时
	}
	return 0;
}

u32 RM_RxDATA_Landis_CHECK(u32 PORTn)//Landis(IEC1107 模式C)帧接收数据检查,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错,3数据标识错
{

	return 0;
}


//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)(ROAD时不写入总关联的OAD个数数组!!!)

u32 RM_RxDATA_Landis(u32 PORTn)//Landis(IEC1107 模式C)抄表接收数据处理:返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
{
	u32 i;
	u32 n;
//	u32 offset;
	u32 OI;
	u32 Data;
//	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
//	u32 signedDI;
	u8* p8Array;
	u8* p8Data;
	u16* p16Data;
	u8* p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
	u8* p8;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);

	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8Data=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8Data+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data+=LEN_RM_DI_CSD+4+LEN_Data1;
	p8Array=(u8*)p8Data;
	if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数(非DL698抄表时)
	{
		p16Data[0]=0;//已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
	}
	LEN_Data0=p16Data[0];
	if(LEN_RxDataBuff<LEN_Data0)
	{//错
		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data0;
	
	switch(UARTCtrl->CONNECT)//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
	{
		case 1://300bps握手
			p8=SearchString(p8rx,(u8 *)"/LGZ",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
			if(p8)
			{
				i=p8[0];
				switch(i)
				{
					default:
					case '0'://300Bd
						i=0;//波特率,O～7依次表示0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
						break;
					case '1'://600Bd
						i=1;
						break;
					case '2'://1200Bd
						i=2;
						break;
					case '3'://2400Bd
						i=3;
						break;
					case '4'://4800Bd
						i=4;
						break;
					case '5'://9600Bd
						i=6;
						break;
				}
				UARTCtrl->BpsCtrl=//通信控制字(同规约2007)(半字对齐)
					(i<<5)|//D8-D5位表示波特率,O～7依次表示0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
								//D4位表示停止位位数0/1分别表示1/2个停止位
					(1<<3)|//D3位表示有无校验位0/1分别表示无/有
								//D2位表示偶／奇校验位0/1分别表示偶／奇校验
						2;	//D1-D0 数据位数0～3分别表示5-8位
				UARTCtrl->CONNECT=100;//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
			}
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		case 101://101=抄表中
			break;
		case 102://关闭连接
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		default://698规约连接和关闭过程
			UARTCtrl->CONNECT=0;//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	
//---后续帧---
	
//---后续帧结束---	
	
	
//---曲线开始---
//用实时数据冻结为曲线
	i=UARTCtrl->RMCSD[1];
	if(i)
	{//ROAD
		OI=UARTCtrl->RMCSD[2+0]<<24;
		OI|=UARTCtrl->RMCSD[2+1]<<16;
		OI|=UARTCtrl->RMCSD[2+2]<<8;
		OI|=UARTCtrl->RMCSD[2+3];
		if(OI==0x50020200)
		{//分钟冻结
			p8Data+=LEN_Data0;
			p8Array=(u8*)p8Data;
			n=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
			OI=(UARTCtrl->RMCSD[7+(4*n)+0]<<24)+(UARTCtrl->RMCSD[7+(4*n)+1]<<16)+(UARTCtrl->RMCSD[7+(4*n)+2]<<8)+(UARTCtrl->RMCSD[7+(4*n)+3]<<0);
			switch(OI)
			{//方案里是”00100201“和”00200201“，主站用”00100200“和”00200200“召读，费率电量可以是空，只把总电量返回就行了
				case 0x00100201://正向有功电能总
				case 0x00200201://反向有功电能总
				case 0x00300201://组合无功1电能总
				case 0x00400201://组合无功2电能总
				case 0x00500201://第1象限无功电能总
				case 0x00600201://第2象限无功电能总
				case 0x00700201://第3象限无功电能总
				case 0x00800201://第4象限无功电能总
				case 0x20000201://A相电压
				case 0x20010201://A相电流
				case 0x20040202://A相有功功率
				case 0x20050202://A相无功功率
				case 0x200A0202://A相功率因数
					UARTCtrl->RMCSD[7+(4*n)+3]=0;
					break;
			}
			switch(OI)
			{
				case 0x20210200://冻结时标
					if(LEN_RxDataBuff<8)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=DataType_date_time_s;
					Get_date_time_s(p8Data+1);//得到date_time_s共7字节
					p8Data+=8;
					LEN_Data0+=8;
					LEN_RxDataBuff-=8;
					break;
				case 0x00100201://正向有功总电能
				case 0x00200201://反向有功总电能
				case 0x00500201://一象限无功总电能
				case 0x00600201://二象限无功总电能
				case 0x00700201://三象限无功总电能
				case 0x00800201://四象限无功总电能
					if(LEN_RxDataBuff<(2+(5*1)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					switch(OI)
					{
						case 0x00100201://正向有功总电能
							p8=SearchString(p8rx,(u8*)"20(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							break;
						case 0x00200201://反向有功总电能
							p8=SearchString(p8rx,(u8*)"22(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							break;
						case 0x00500201://一象限无功总电能
						case 0x00600201://二象限无功总电能
						case 0x00700201://三象限无功总电能
						case 0x00800201://四象限无功总电能
						default:
							p8=0;
							break;
					}
					if(p8)
					{
						Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
					}
					else
					{
						p8Data[0]=0;//空
						p8Data+=1;
						LEN_Data0+=1;
					}
					if(LEN_RxDataBuff<4)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[1]=5;//数组数
					p8Data[0]=0;//费率1
					p8Data[1]=0;//费率2
					p8Data[2]=0;//费率3
					p8Data[3]=0;//费率4
					p8Data+=4;
					LEN_Data0+=4;
					LEN_RxDataBuff-=4;
					break;
				case 0x00300201://组合无功1总电能
				case 0x00400201://组合无功2总电能
					if(LEN_RxDataBuff<(2+(5*1)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					switch(OI)
					{
						case 0x00300201://组合无功1总电能
							p8=SearchString(p8rx,(u8*)"21(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							break;
						case 0x00400201://组合无功2总电能
							p8=SearchString(p8rx,(u8*)"23(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							break;
						default:
							p8=0;
							break;
					}
					if(p8)
					{
						Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
						p8Data[0]=DataType_double_long_unsigned;
						p8Data[1]=Data>>24;
						p8Data[2]=Data>>16;
						p8Data[3]=Data>>8;
						p8Data[4]=Data>>0;
						p8Data+=5;
						LEN_Data0+=5;
					}
					else
					{
						p8Data[0]=0;//空
						p8Data+=1;
						LEN_Data0+=1;
					}
					if(LEN_RxDataBuff<4)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[1]=5;//数组数
					p8Data[0]=0;//费率1
					p8Data[1]=0;//费率2
					p8Data[2]=0;//费率3
					p8Data[3]=0;//费率4
					p8Data+=4;
					LEN_Data0+=4;
					LEN_RxDataBuff-=4;
					break;
//				case 0x20170200://当前有功需量
//				case 0x20180200://当前无功需量
//				//case 0x11100200://冻结周期内正向有功最大需量 
//					break;
				case 0x20000200://电压
					if(LEN_RxDataBuff<(2+(3*3)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=3;//数组数
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<3;i++)
					{
						switch(i)
						{
							case 0://A
								p8=SearchString(p8rx,(u8*)"L.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
							case 1://B
								p8=SearchString(p8rx,(u8*)"L.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
							case 2://C
								p8=SearchString(p8rx,(u8*)"L.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
						}
						//DL2007数据格式:DL2007返回数据格式:XXX.X
						//Landis数据格式:L.1(---.-*V)
						if(p8)
						{
							Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
							p8Data[0]=DataType_long_unsigned;
							p8Data[1]=Data>>8;
							p8Data[2]=Data;
							p8Data+=3;
							LEN_Data0+=3;
							LEN_RxDataBuff-=3;
						}
						else
						{
							p8Data[0]=0;//空
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
						}						
					}
					break;
				case 0x20010200://电流
					if(LEN_RxDataBuff<(2+(5*3)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=3;//数组数
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<3;i++)
					{
						switch(i)
						{
							case 0://A
								p8=SearchString(p8rx,(u8*)"A(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
							case 1://B
								p8=SearchString(p8rx,(u8*)"B(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
							case 2://C
								p8=SearchString(p8rx,(u8*)"C(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
						}
						//DL2007数据格式:XXX.XXX
						//Landis数据格式:A(00.00*A)
						if(p8)
						{
							if(p8[0]=='-')
							{//负
								Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
								Data*=10;
								Data=~Data;
								Data+=1;
							}
							else
							{//正
								Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
								Data*=10;
							}
							p8Data[0]=DataType_double_long;
							p8Data[1]=Data>>24;
							p8Data[2]=Data>>16;
							p8Data[3]=Data>>8;
							p8Data[4]=Data>>0;
							p8Data+=5;
							LEN_Data0+=5;
							LEN_RxDataBuff-=5;
						}
						else
						{
							p8Data[0]=0;//空
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
						}
					}
					break;
//				case 0x20010400://零线电流
//					//零线电流无数组
//					break;
//				case 0x20040200://有功功率
//				case 0x20050200://无功功率
//					break;
				case 0x200A0200://功率因数
					if(LEN_RxDataBuff<(2+(3*4)))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Array[0]=DataType_array;
					p8Array[1]=4;//数组数
					p8Data+=2;
					LEN_Data0+=2;
					LEN_RxDataBuff-=2;
					for(i=0;i<4;i++)
					{
						switch(i)
						{
							case 0://总
								p8=SearchString(p8rx,(u8*)"13.7(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
								break;
							case 1://A
								p8=0;
								break;
							case 2://B
								p8=0;
								break;
							case 3://C
								p8=0;
								break;
						}
						//数组数;DL2007返回数据格式:XX.XX
						//Dandis数据格式:13.7( -.--)
						if(p8)
						{
							if(p8[0]=='-')
							{//负
								Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
								Data=~Data;
								Data+=1;
							}
							else
							{//正
								Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
							}
							p8Data[0]=DataType_long;
							p8Data[1]=Data>>8;
							p8Data[2]=Data;
							p8Data+=3;
							LEN_Data0+=3;
							LEN_RxDataBuff-=3;
						}
						else
						{
							p8Data[0]=0;//空
							p8Data+=1;
							LEN_Data0+=1;
							LEN_RxDataBuff-=1;
						}
					}					
					break;
//				case 0x20000201://A电压
//					break;
//				case 0x20010201://A电流
//					break;
//				case 0x20040202://A相有功功率
//				case 0x20050202://A相无功功率
//					break;
//				case 0x200A0202://A相功率因数
//					break;
				default:
					if(LEN_RxDataBuff<1)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=0;
					p8Data+=1;
					LEN_Data0+=1;
					LEN_RxDataBuff-=1;
					break;
			}
			p16Data[0]=LEN_Data0;
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
	}
//---曲线结束---
	
	
