gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_Landis.c
//---事件类开始---
	
	
//---事件类结束---

	i=UARTCtrl->RMCSD[1];//当前正在抄的CSD(有数据类型)
	if(i==0)
	{//OAD
		OI=UARTCtrl->RMCSD[2]<<8;//当前正在抄的CSD
		OI|=UARTCtrl->RMCSD[3];
	}
	else
	{//ROAD
		i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内关联的OAD计数(非DL698抄表时)
		i*=4;
		OI=UARTCtrl->RMCSD[7+i]<<8;//当前正在抄的CSD
		OI|=UARTCtrl->RMCSD[7+i+1];
	}
	i=OI_IC(OI);//得到接口类号;入口:对象标识OI
	switch(i)
	{
		case 1://电能量接口类,本接口类对象提供存储电能量类信息
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及费率电能量数组∷=array 电能量
				//电能量：
				//CHOICE
				//{
				//double-long-unsigned   [6]，
				//double-long            [5]
				//}
					if(LEN_RxDataBuff<(5*5))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					switch(OI)
					{
						case 0x0010://正有功
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"20(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"8.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"8.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"8.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"8.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									LEN_Data0+=5;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x0020://反有功
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"22(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"38.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"38.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"38.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"38.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									LEN_Data0+=5;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x0030://组合无功1(正无功)
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"21(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"9.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"9.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"9.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"9.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									LEN_Data0+=5;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x0040://组合无功2(反无功)
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"23(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"39.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"39.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"39.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"39.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									LEN_Data0+=5;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
//				case 4://高精度总及费率电能量数组∷=array 高精度电能量
//				//高精度电能量：
//				//CHOICE
//				//{
//				//long64-unsigned        [21]，
//				//long64                 [20]
//				//}

