gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_Landis.c
//					break;
				default:
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 2://最大需量接口类,本接口类对象提供存储最大需量类信息
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及费率最大需量数组∷=array 最大需量及发生时间
				//最大需量及发生时间∷=structure
				//{
				//  最大需量值 CHOICE，
				//  发生时间   date_time_s
				//}
				//最大需量值 ：
				//CHOICE
				//{
				//double-long            [5]，
				//double-long-unsigned   [6]
				//}
					if(LEN_RxDataBuff<(13*5))
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					switch(OI)
					{
						case 0x1010://正有功
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"6.0(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"6.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"6.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"6.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"6.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
						//数组数;DL2007返回数据格式:XX.XXXX YYMMDDhhmm
						//Landis返回数据格式 6(0.083*kW)(03-06-11 10:48)<CR><LF>
								if(p8)
								{
									//值
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									Data*=10;
									p8Data[0]=DataType_structure;
									p8Data[1]=2;
									p8Data+=2;
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									//发生时间
									p8=SearchString(p8,(u8*)"(",17,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
									if(p8)
									{
										p8Data[0]=DataType_date_time_s;
										Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data+=2000;
										p8Data[1]=Data>>8;//年
										p8Data[2]=Data;
										Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[3]=Data;//月
										Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[4]=Data;//日
										Data=ASCII_BCD((u32)p8+9,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data=ASCII_BCD((u32)p8+12,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[6]=Data;//分
										p8Data[7]=0;//秒
										p8rx+=5;
										p8Data+=8;
										LEN_Data0+=2+5+8;
									}
									else
									{
										p8Data[0]=0;//空
										p8Data+=1;
										LEN_Data0+=1;
									}
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x1020://反有功
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"36.0(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"36.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"36.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"36.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"36.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
						//数组数;DL2007返回数据格式:XX.XXXX YYMMDDhhmm
						//Landis返回数据格式 6(0.083*kW)(03-06-11 10:48)<CR><LF>
								if(p8)
								{
									//值
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									Data*=10;
									p8Data[0]=DataType_structure;
									p8Data[1]=2;
									p8Data+=2;
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									//发生时间
									p8=SearchString(p8,(u8*)"(",17,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
									if(p8)
									{
										p8Data[0]=DataType_date_time_s;
										Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data+=2000;
										p8Data[1]=Data>>8;//年
										p8Data[2]=Data;
										Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[3]=Data;//月
										Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[4]=Data;//日
										Data=ASCII_BCD((u32)p8+9,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data=ASCII_BCD((u32)p8+12,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[6]=Data;//分
										p8Data[7]=0;//秒
										p8rx+=5;
										p8Data+=8;
										LEN_Data0+=2+5+8;
									}
									else
									{
										p8Data[0]=0;//空
										p8Data+=1;
										LEN_Data0+=1;
									}
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x1030://组合无功1(正无功)
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"7.0(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"7.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"7.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"7.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"7.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
						//数组数;DL2007返回数据格式:XX.XXXX YYMMDDhhmm
						//Landis返回数据格式 7.0(00.00*kvar)(00-00-00 00:00)<CR><LF>
								if(p8)
								{
									//值
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									Data*=10;
									p8Data[0]=DataType_structure;
									p8Data[1]=2;
									p8Data+=2;
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									//发生时间
									p8=SearchString(p8,(u8*)"(",17,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
									if(p8)
									{
										p8Data[0]=DataType_date_time_s;
										Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data+=2000;
										p8Data[1]=Data>>8;//年
										p8Data[2]=Data;
										Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[3]=Data;//月
										Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[4]=Data;//日
										Data=ASCII_BCD((u32)p8+9,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data=ASCII_BCD((u32)p8+12,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[6]=Data;//分
										p8Data[7]=0;//秒
										p8rx+=5;
										p8Data+=8;
										LEN_Data0+=2+5+8;
									}
									else
									{
										p8Data[0]=0;//空
										p8Data+=1;
										LEN_Data0+=1;
									}
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x1040://组合无功2(反无功)
							for(i=0;i<5;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"37.0(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://尖
										p8=SearchString(p8rx,(u8*)"37.4(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://峰
										p8=SearchString(p8rx,(u8*)"37.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 3://平
										p8=SearchString(p8rx,(u8*)"37.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 4://谷
										p8=SearchString(p8rx,(u8*)"37.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
						//数组数;DL2007返回数据格式:XX.XXXX YYMMDDhhmm
						//Landis返回数据格式 7.0(00.00*kvar)(00-00-00 00:00)<CR><LF>
								if(p8)
								{
									//值
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									Data*=10;
									p8Data[0]=DataType_structure;
									p8Data[1]=2;
									p8Data+=2;
									p8Data[0]=DataType_double_long_unsigned;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									//发生时间
									p8=SearchString(p8,(u8*)"(",17,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
									if(p8)
									{
										p8Data[0]=DataType_date_time_s;
										Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data+=2000;
										p8Data[1]=Data>>8;//年
										p8Data[2]=Data;
										Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[3]=Data;//月
										Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[4]=Data;//日
										Data=ASCII_BCD((u32)p8+9,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										Data=ASCII_BCD((u32)p8+12,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
										Data=bcd_hex(Data);
										p8Data[6]=Data;//分
										p8Data[7]=0;//秒
										p8rx+=5;
										p8Data+=8;
										LEN_Data0+=2+5+8;
									}
									else
									{
										p8Data[0]=0;//空
										p8Data+=1;
										LEN_Data0+=1;
									}
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=5;//数组数
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				default:
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 3://分相变量接口类,本接口类对象提供存储电压、电流、相角等分相变量类信息
		//分相数值组∷=array 分相数值
		//数值组按A相、B相、C相、N线顺序排列，其中：仅电流有N线，另外，当接线方式为单相时，A、B、C三相改为A相（某一相）。
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://分相数值组
					switch(OI)
					{
						case 0x2000://电压
							if(LEN_RxDataBuff<(3*3))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<3;i++)
							{
								switch(i)
								{
									case 0://A
										p8=SearchString(p8rx,(u8*)"L.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://B
										p8=SearchString(p8rx,(u8*)"L.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://C
										p8=SearchString(p8rx,(u8*)"L.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								//DL2007数据格式:DL2007返回数据格式:XXX.X
								//Landis数据格式:L.1(---.-*V)
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_long_unsigned;
									p8Data[1]=Data>>8;
									p8Data[2]=Data;
									p8Data+=3;
									LEN_Data0+=3;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=3;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x2001://电流
							if(LEN_RxDataBuff<(5*3))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<3;i++)
							{
								switch(i)
								{
									case 0://A
										p8=SearchString(p8rx,(u8*)"A(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://B
										p8=SearchString(p8rx,(u8*)"B(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://C
										p8=SearchString(p8rx,(u8*)"C(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								//DL2007数据格式:XXX.XXX
								//Landis数据格式:A(00.00*A)
								if(p8)
								{
									if(p8[0]=='-')
									{//负
										Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
										Data*=10;
										Data=~Data;
										Data+=1;
									}
									else
									{//正
										Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
										Data*=10;
									}
									p8Data[0]=DataType_double_long;
									p8Data[1]=Data>>24;
									p8Data[2]=Data>>16;
									p8Data[3]=Data>>8;
									p8Data[4]=Data>>0;
									p8Data+=5;
									LEN_Data0+=5;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=3;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x2002://电压相角
							if(LEN_RxDataBuff<(3*3))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<3;i++)
							{
								switch(i)
								{
									case 0://A
										p8=SearchString(p8rx,(u8*)"31.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://B
										p8=SearchString(p8rx,(u8*)"31.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://C
										p8=SearchString(p8rx,(u8*)"31.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								//数组数;DL2007返回数据格式:XXX.X
								//Dandis数据格式:31.1(----*Deg)
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_long_unsigned;
									p8Data[1]=Data>>8;
									p8Data[2]=Data;
									p8Data+=3;
									LEN_Data0+=3;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=3;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x2003://电压电流相角
							if(LEN_RxDataBuff<(3*3))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<3;i++)
							{
								switch(i)
								{
									case 0://A
										p8=SearchString(p8rx,(u8*)"51.1(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://B
										p8=SearchString(p8rx,(u8*)"51.2(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 2://C
										p8=SearchString(p8rx,(u8*)"51.3(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
								}
								//数组数;DL2007返回数据格式:XXX.X
								//Dandis数据格式:51.1(----*Deg)
								if(p8)
								{
									Data=ASCIIdp_HEX(p8);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									p8Data[0]=DataType_long_unsigned;
									p8Data[1]=Data>>8;
									p8Data[2]=Data;
									p8Data+=3;
									LEN_Data0+=3;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=3;//数组数
							p16Data[0]=LEN_Data0;
							break;
						case 0x200B://电压波形失真度
						case 0x200C://电流波形失真度
						default:
							return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				case 4://零线电流
				default:
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
		case 4://功率接口类,本接口类对象提供存储功率、功率因数等信息
			//总及分相数值组∷=array 总或分相数值
			//数值组按总、A相、B相、C相顺序排列，当接线方式为单相时，为总、A相（某一相）
			if(LEN_Data0==0)
			{
				if(LEN_RxDataBuff<2)
				{//缓冲长度不够
					return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				p8Array[0]=DataType_array;
				p8Array[1]=0;
				LEN_Data0=2;
				LEN_RxDataBuff-=2;
			}
			switch(UARTCtrl->RMCSD[4])//属性
			{
				case 2://总及分相数值组
					switch(OI)
					{
						case 0x2004://有功功率
						case 0x2005://无功功率
							
