gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_Landis.c
						case 0x2006://视在功率
						case 0x2007://一分钟平均有功功率
						case 0x2008://一分钟平均无功功率
						case 0x2009://一分钟平均视在功率
							break;
						case 0x200A://功率因数
							if(LEN_RxDataBuff<(3*4))
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							for(i=0;i<4;i++)
							{
								switch(i)
								{
									case 0://总
										p8=SearchString(p8rx,(u8*)"13.7(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
										break;
									case 1://A
										p8=0;
										break;
									case 2://B
										p8=0;
										break;
									case 3://C
										p8=0;
										break;
								}
								//数组数;DL2007返回数据格式:XX.XX
								//Dandis数据格式:13.7( -.--)
								if(p8)
								{
									if(p8[0]=='-')
									{//负
										Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
										Data=~Data;
										Data+=1;
									}
									else
									{//正
										Data=ASCIIdp_HEX(p8+1);//有小数点10进制的ASCII码转为HEX,例"1234.56"->0x1e240,入口:ASCII码开始地址,非0-9和'.'ASCII码为结束
									}
									p8Data[0]=DataType_long;
									p8Data[1]=Data>>8;
									p8Data[2]=Data;
									p8Data+=3;
									LEN_Data0+=3;
								}
								else
								{
									p8Data[0]=0;//空
									p8Data+=1;
									LEN_Data0+=1;
								}
							}
							p8Array[1]=4;//数组数
							p16Data[0]=LEN_Data0;
							break;
						default:
							return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					break;
				default:
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			break;
//		case 5://谐波变量接口类,本接口类对象提供存储谐波变量类信息
//			break;
		case 6://数据变量接口类,本接口类对象提供存储过程值或与过程值单元相关的状态值信息
//			switch(OI)
//			{
//				case 0x2014://电表运行状态字1-7
//				case 0x202D://（当前）透支金额  数据类型：double-long-unsigned，单位：元，换算：-2
//				default:
//					return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//			}
//			break;
			return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//		case 7://事件对象接口类,本接口类对象提供配置、存储事件记录类信息
//			break;
		case 8://参数变量接口类,本接口类对象提供存储终端的各种参数类信息
			switch(OI)
			{
				case 0x2021://数据冻结时间
					if(LEN_RxDataBuff<8)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data+=LEN_Data0;
					p8Array=(u8*)p8Data;
					p8Data[0]=DataType_date_time_s;
					Get_date_time_s(p8Data+1);//得到date_time_s共7字节
					p8Data+=8;
					LEN_Data0+=8;
					LEN_RxDataBuff-=8;
					p16Data[0]=LEN_Data0;
					break;
				case 0x4000://日期时间
					switch(UARTCtrl->RMCSDSubCount)//抄表CSD子计数(非DL698抄表时)
					{
						case 0://电能表日历时钟Hhmmss
							if(LEN_RxDataBuff<8)
							{//缓冲长度不够
								return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
							}
							p8Data+=LEN_Data0;
							//11(15:28:42)
							p8Data[0]=DataType_date_time_s;
							p8Data[1]=0;//年
							p8Data[2]=0;
							p8Data[3]=0;//月
							p8Data[4]=0;//日
							p8Data[5]=0;//时
							p8Data[6]=0;//分
							p8Data[7]=0;//秒
							p8=SearchString(p8rx,(u8*)"11(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							if(p8)
							{
								Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								p8Data[5]=Data;//时
								Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								p8Data[6]=Data;//分
								Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								p8Data[7]=Data;//秒
							}
							LEN_Data0+=8;
							p16Data[0]=LEN_Data0;
							break;
						case 1://电能表日历时钟YYMMDDWW
							if(LEN_Data0<8)
							{
								break;//已填写入buff但还没完整一个CSD的数据长度
							}
							p8Data+=LEN_Data0;
							p8Data-=8;
							p8=SearchString(p8rx,(u8*)"12(",UARTCtrl->RxByte,0);//数据搜索:入口:pStd为要从pData中的数据串,LEN_pData=pData总字节数,LEN_Std=要找的数据串字节数(0值表示要找的数据串为以0结束的标准字符串),返回:0=没找到,!=0为从pData找到相同串后的第1个字节地址
							if(p8)
							{
								Data=ASCII_BCD((u32)p8,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								Data+=2000;
								p8Data[1]=Data>>8;//年
								p8Data[2]=Data;
								Data=ASCII_BCD((u32)p8+3,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								p8Data[3]=Data;//月
								Data=ASCII_BCD((u32)p8+6,2);//16进制的ASCII码转为BCD,例"12AB"->0x12AB,入口ASCII码开始地址和ASCII码字节数,返回=0xFFFFFFFF表示错误ASCII码非0-9,A-F值
								Data=bcd_hex(Data);
								p8Data[4]=Data;//日
							}
							break;
					}
					break;
				case 0x202C://（当前）钱包文件 剩余金额	double-long-unsigned（单位：元，换算：-2）， 购电次数	double-long-unsigned
					break;
			}
			break;
//		case 9://冻结数据接口类,本接口类对象提供配置、存储冻结数据及其相关信息
//			break;
//		case 10://采集监控接口类
//			break;
//		case 11://集合接口类,本接口类对象提供配置、存储终端采集数据及其相关信息
//			break;
//		case 12://脉冲计量接口类
//			break;
//		case 13://负荷控制对象接口类,本接口类对象提供负荷管理有关的控制功能
//			break;
//		case 14://区间统计接口类,本接口类对象提供依据配置参数判定、统计与越限相关的信息
//			break;
//		case 15://累加平均接口类,本接口类对象提供对相同物理属性的数值进行累加、平均的运算功能
//			break;
//		case 16://极值工具接口类,本接口类对象提供采集或生成最大、最小值及其发生时间
//			break;
//		case 17://显示接口类,本接口类对象提供与终端显示或对外打印相关的信息
//			break;
//		case 18://文件传输接口类,本接口类对象提供终端实现上传和下载文件的功能
//			break;
//		case 19://设备管理接口类,
//			break;
//		case 20://应用连接接口类
//			break;
//		case 21://ESAM接口类
//			break;
//		case 22://输入输出设备接口类
//			break;
//		case 23://总加组接口类
//			break;
//		case 24://分项事件对象接口类,本接口类对象提供配置、存储分项事件记录类信息
//			break;
//		case 25://无线公网通信接口类
//			break;
//		case 26://以太网通信接口类
//			break;
		default:
			//测试看未处理的OI值
			i=OI_IC(OI);//得到接口类号;入口:对象标识OI
			if(i)
			{
				i=i;
			}
			return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
}








































